import pandas as pd
import os
from new_reder_soil_data import SoilData

class SoilDataReder:
    column_new_data=['file_path', 'Рік', 'Область', 'Метеостанція', 'Ділянка', 'Культура', 'Ґрунт', 'Дата',
                          "Об'ємна маса ґрунту на глибині ґрунту 10 см, г/см3",
                          "Об'ємна маса ґрунту на глибині ґрунту 20 см, г/см3",
                          "Об'ємна маса ґрунту на глибині ґрунту 30 см, г/см3",
                          "Об'ємна маса ґрунту на глибині ґрунту 40 см, г/см3",
                          "Об'ємна маса ґрунту на глибині ґрунту 50 см, г/см3",
                          "Об'ємна маса ґрунту на глибині ґрунту 60 см, г/см3",
                          "Об'ємна маса ґрунту на глибині ґрунту 70 см, г/см3",
                          "Об'ємна маса ґрунту на глибині ґрунту 80 см, г/см3",
                          "Об'ємна маса ґрунту на глибині ґрунту 90 см, г/см3",
                          "Об'ємна маса ґрунту на глибині ґрунту 100 см, г/см3",
                          'Запаси непродуктивної вологи на глибині ґрунту 10 см, мм',
                          'Запаси непродуктивної вологи на глибині ґрунту 20 см, мм',
                          'Запаси непродуктивної вологи на глибині ґрунту 30 см, мм',
                          'Запаси непродуктивної вологи на глибині ґрунту 40 см, мм',
                          'Запаси непродуктивної вологи на глибині ґрунту 50 см, мм',
                          'Запаси непродуктивної вологи на глибині ґрунту 60 см, мм',
                          'Запаси непродуктивної вологи на глибині ґрунту 70 см, мм',
                          'Запаси непродуктивної вологи на глибині ґрунту 80 см, мм',
                          'Запаси непродуктивної вологи на глибині ґрунту 90 см, мм',
                          'Запаси непродуктивної вологи на глибині ґрунту 100 см, мм',
                          'Запаси продуктивної вологи при НВ на глибині ґрунту 10 см, мм',
                          'Запаси продуктивної вологи при НВ на глибині ґрунту 20 см, мм',
                          'Запаси продуктивної вологи при НВ на глибині ґрунту 30 см, мм',
                          'Запаси продуктивної вологи при НВ на глибині ґрунту 40 см, мм',
                          'Запаси продуктивної вологи при НВ на глибині ґрунту 50 см, мм',
                          'Запаси продуктивної вологи при НВ на глибині ґрунту 60 см, мм',
                          'Запаси продуктивної вологи при НВ на глибині ґрунту 70 см, мм',
                          'Запаси продуктивної вологи при НВ на глибині ґрунту 80 см, мм',
                          'Запаси продуктивної вологи при НВ на глибині ґрунту 90 см, мм',
                          'Запаси продуктивної вологи при НВ на глибині ґрунту 100 см, мм',
                          'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 10 см, %',
                          'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 20 см, %',
                          'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 30 см, %',
                          'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 40 см, %',
                          'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 50 см, %',
                          'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 60 см, %',
                          'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 70 см, %',
                          'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 80 см, %',
                          'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 90 см, %',
                          'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 100 см, %',
                          'Запаси загальної вологи по шарах на глибині ґрунту 10 см, мм',
                          'Запаси загальної вологи по шарах на глибині ґрунту 20 см, мм',
                          'Запаси загальної вологи по шарах на глибині ґрунту 30 см, мм',
                          'Запаси загальної вологи по шарах на глибині ґрунту 40 см, мм',
                          'Запаси загальної вологи по шарах на глибині ґрунту 50 см, мм',
                          'Запаси загальної вологи по шарах на глибині ґрунту 60 см, мм',
                          'Запаси загальної вологи по шарах на глибині ґрунту 70 см, мм',
                          'Запаси загальної вологи по шарах на глибині ґрунту 80 см, мм',
                          'Запаси загальної вологи по шарах на глибині ґрунту 90 см, мм',
                          'Запаси загальної вологи по шарах на глибині ґрунту 100 см, мм',
                          'Запаси продуктивної вологи по шарах на глибині ґрунту 10 см, мм',
                          'Запаси продуктивної вологи по шарах на глибині ґрунту 20 см, мм',
                          'Запаси продуктивної вологи по шарах на глибині ґрунту 30 см, мм',
                          'Запаси продуктивної вологи по шарах на глибині ґрунту 40 см, мм',
                          'Запаси продуктивної вологи по шарах на глибині ґрунту 50 см, мм',
                          'Запаси продуктивної вологи по шарах на глибині ґрунту 60 см, мм',
                          'Запаси продуктивної вологи по шарах на глибині ґрунту 70 см, мм',
                          'Запаси продуктивної вологи по шарах на глибині ґрунту 80 см, мм',
                          'Запаси продуктивної вологи по шарах на глибині ґрунту 90 см, мм',
                          'Запаси продуктивної вологи по шарах на глибині ґрунту 100 см, мм',
                          'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 10 см, мм',
                          'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 20 см, мм',
                          'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 30 см, мм',
                          'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 40 см, мм',
                          'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 50 см, мм',
                          'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 60 см, мм',
                          'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 70 см, мм',
                          'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 80 см, мм',
                          'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 90 см, мм',
                          'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 100 см, мм']

    def __init__(self, file):
        self.name_file = file
        self.year = None
        self.region = None
        self.weather_station = None
        self.month = None
        self.date_1 = None
        self.date_2 = None
        self.date_3 = None
        self.culture = None
        self.previous_culture = None
        self.soil_type = None
        self.plot = None
        # self.data_sheets = self.open_data(file_path=file)
        # self.process_all_sheets()
        self.special_data_frame = pd.DataFrame(columns=self.column_new_data)


    def extract_data_from_excel(self):
        xls = pd.ExcelFile(self.name_file)
        df_final = pd.DataFrame()

        for sheet_name in xls.sheet_names:
            print(f"Processing sheet: {sheet_name}")
            data = pd.read_excel(xls, sheet_name=sheet_name)
            df = self.process_data(data)
            df_final = pd.concat([df_final, df], ignore_index=True)

        return df_final

    def process_data(self, data):
        df = pd.DataFrame()
        data_index = 0
        for idx, row in data.iterrows():
            for col_idx, cell in enumerate(row):
                if pd.notna(cell):
                    previous_cell = data.iloc[
                            idx - 1, col_idx] if idx > 0 else None  # Cell above the current cell
                    previous_3rd_cell = data.iloc[
                            idx - 3, col_idx] if idx > 2 else None  # Three cells above the current cell

                        # Condition for date and "середня" related data
                    if "середня" in str(cell) and ("4" in str(previous_cell) or "2" in str(previous_3rd_cell)):
                        date_slice = data.iloc[max(0, idx - 3):idx + 1, 0].dropna()  # Use max to avoid negative indexing issues
                        date = date_slice.iloc[-1] if not date_slice.empty else None

                        if date is not None:
                            data_index = idx  # Use this index for data storage for related conditions
                            df.loc[data_index, 'Дата'] = date  # Store the date for this condition

                    if "Ґрунт" in str(cell):
                        soil_info = data.iloc[idx, col_idx + 1:col_idx + 8].dropna().tolist()
                        df.loc[0, 'Ґрунт'] = ' '.join(soil_info)
                        # Plot information
                    if "Ділянка" in str(cell):
                            # plot_info = xls_data.iloc[idx, col_idx+1:col_idx+8].dropna().tolist()
                        plot_info = [str(item) for item in data.iloc[idx, col_idx + 1:col_idx + 8].dropna().tolist()]
                        if plot_info == []:
                            df.loc[0, 'Ділянка'] = cell
                        else:
                            df.loc[0, 'Ділянка'] = ' '.join(plot_info)

                    conditions = {
                            "Об'ємна маса": "Об'ємна маса ґрунту на глибині ґрунту {} см, г/см3",
                            "непродуктивної": "Запаси непродуктивної вологи на глибині ґрунту {} см, мм",
                            "продуктивної при НВ": "Запаси продуктивної вологи при НВ на глибині ґрунту {} см, мм"
                        }

                    for key, format_str in conditions.items():
                        if key in str(cell):
                            data = data.iloc[idx, col_idx + 1:col_idx + 101].dropna().tolist()[:10]
                            columns = [format_str.format(i * 10) for i in range(1, len(data) + 1)]
                            df.loc[data_index, columns] = data
                        # Additional moisture content conditions
                        if "середня" in str(cell) and ("4" in str(previous_cell) or "2" in str(previous_3rd_cell)):
                            average_moisture = data.iloc[idx, col_idx + 1:col_idx + 101].dropna().tolist()[:10]
                            average_columns = [ f'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту {i * 10} см, %' for
                                i in range(1, len(average_moisture) + 1)]
                            df.loc[data_index, average_columns] = average_moisture

                        # Moisture by layers
                        if "по шарах" in str(cell):
                            if "середня" in str(previous_cell):
                                total_moisture_layers = data.iloc[idx, col_idx + 1:col_idx + 101].dropna().tolist()[
                                                        :10]
                                total_layers_columns = [
                                    f'Запаси загальної вологи по шарах на глибині ґрунту {i * 10} см, мм' for i in
                                    range(1, len(total_moisture_layers) + 1)]
                                df.loc[data_index, total_layers_columns] = total_moisture_layers
                            elif "по шарах" in str(previous_cell):
                                productive_moisture_layers = data.iloc[idx,col_idx + 1:col_idx + 101].dropna().tolist()[:10]
                                productive_layers_columns = [
                                    f'Запаси продуктивної вологи по шарах на глибині ґрунту {i * 10} см, мм' for i in
                                    range(1, len(productive_moisture_layers) + 1)]
                                df.loc[data_index, productive_layers_columns] = productive_moisture_layers

                        if "наростаючим" in str(cell) and "по шарах" in str(previous_cell):
                            cumulative_moisture = data.iloc[idx, col_idx + 1:col_idx + 101].dropna().tolist()[:10]
                            cumulative_columns = [
                                f'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту {i * 10} см, мм'
                                for i in range(1, len(cumulative_moisture) + 1)]
                            df.loc[data_index, cumulative_columns] = cumulative_moisture

        return df

        # Ваша логіка обробки даних


path_all_folders = r"C:\Users\user\PycharmProjects\data_drought\DATA_base_soil_water"

#Create and empty database
df_DB = pd.DataFrame(columns = ['file_path', 'Рік','Область', 'Метеостанція', 'Ділянка', 'Культура', 'Ґрунт', 'Дата',
       "Об'ємна маса ґрунту на глибині ґрунту 10 см, г/см3",
       "Об'ємна маса ґрунту на глибині ґрунту 20 см, г/см3",
       "Об'ємна маса ґрунту на глибині ґрунту 30 см, г/см3",
       "Об'ємна маса ґрунту на глибині ґрунту 40 см, г/см3",
       "Об'ємна маса ґрунту на глибині ґрунту 50 см, г/см3",
       "Об'ємна маса ґрунту на глибині ґрунту 60 см, г/см3",
       "Об'ємна маса ґрунту на глибині ґрунту 70 см, г/см3",
       "Об'ємна маса ґрунту на глибині ґрунту 80 см, г/см3",
       "Об'ємна маса ґрунту на глибині ґрунту 90 см, г/см3",
       "Об'ємна маса ґрунту на глибині ґрунту 100 см, г/см3",
       'Запаси непродуктивної вологи на глибині ґрунту 10 см, мм',
       'Запаси непродуктивної вологи на глибині ґрунту 20 см, мм',
       'Запаси непродуктивної вологи на глибині ґрунту 30 см, мм',
       'Запаси непродуктивної вологи на глибині ґрунту 40 см, мм',
       'Запаси непродуктивної вологи на глибині ґрунту 50 см, мм',
       'Запаси непродуктивної вологи на глибині ґрунту 60 см, мм',
       'Запаси непродуктивної вологи на глибині ґрунту 70 см, мм',
       'Запаси непродуктивної вологи на глибині ґрунту 80 см, мм',
       'Запаси непродуктивної вологи на глибині ґрунту 90 см, мм',
       'Запаси непродуктивної вологи на глибині ґрунту 100 см, мм',
       'Запаси продуктивної вологи при НВ на глибині ґрунту 10 см, мм',
       'Запаси продуктивної вологи при НВ на глибині ґрунту 20 см, мм',
       'Запаси продуктивної вологи при НВ на глибині ґрунту 30 см, мм',
       'Запаси продуктивної вологи при НВ на глибині ґрунту 40 см, мм',
       'Запаси продуктивної вологи при НВ на глибині ґрунту 50 см, мм',
       'Запаси продуктивної вологи при НВ на глибині ґрунту 60 см, мм',
       'Запаси продуктивної вологи при НВ на глибині ґрунту 70 см, мм',
       'Запаси продуктивної вологи при НВ на глибині ґрунту 80 см, мм',
       'Запаси продуктивної вологи при НВ на глибині ґрунту 90 см, мм',
       'Запаси продуктивної вологи при НВ на глибині ґрунту 100 см, мм',
       'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 10 см, %',
       'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 20 см, %',
       'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 30 см, %',
       'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 40 см, %',
       'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 50 см, %',
       'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 60 см, %',
       'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 70 см, %',
       'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 80 см, %',
       'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 90 см, %',
       'Вологість від абсолютно сухого ґрунту (середня) на глибині ґрунту 100 см, %',
       'Запаси загальної вологи по шарах на глибині ґрунту 10 см, мм',
       'Запаси загальної вологи по шарах на глибині ґрунту 20 см, мм',
       'Запаси загальної вологи по шарах на глибині ґрунту 30 см, мм',
       'Запаси загальної вологи по шарах на глибині ґрунту 40 см, мм',
       'Запаси загальної вологи по шарах на глибині ґрунту 50 см, мм',
       'Запаси загальної вологи по шарах на глибині ґрунту 60 см, мм',
       'Запаси загальної вологи по шарах на глибині ґрунту 70 см, мм',
       'Запаси загальної вологи по шарах на глибині ґрунту 80 см, мм',
       'Запаси загальної вологи по шарах на глибині ґрунту 90 см, мм',
       'Запаси загальної вологи по шарах на глибині ґрунту 100 см, мм',
       'Запаси продуктивної вологи по шарах на глибині ґрунту 10 см, мм',
       'Запаси продуктивної вологи по шарах на глибині ґрунту 20 см, мм',
       'Запаси продуктивної вологи по шарах на глибині ґрунту 30 см, мм',
       'Запаси продуктивної вологи по шарах на глибині ґрунту 40 см, мм',
       'Запаси продуктивної вологи по шарах на глибині ґрунту 50 см, мм',
       'Запаси продуктивної вологи по шарах на глибині ґрунту 60 см, мм',
       'Запаси продуктивної вологи по шарах на глибині ґрунту 70 см, мм',
       'Запаси продуктивної вологи по шарах на глибині ґрунту 80 см, мм',
       'Запаси продуктивної вологи по шарах на глибині ґрунту 90 см, мм',
       'Запаси продуктивної вологи по шарах на глибині ґрунту 100 см, мм',
       'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 10 см, мм',
       'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 20 см, мм',
       'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 30 см, мм',
       'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 40 см, мм',
       'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 50 см, мм',
       'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 60 см, мм',
       'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 70 см, мм',
       'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 80 см, мм',
       'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 90 см, мм',
       'Запаси продуктивної вологи наростаючим підсумком на глибині ґрунту 100 см, мм'])

for year in ['2016', '2017', '2018', '2019', '2020', '2021']:
    print(year)
    for folder_obl in os.listdir(f"{path_all_folders}/ТСГ-6_{year}"):
        print(folder_obl)
        for folder_st in os.listdir(f"{path_all_folders}/ТСГ-6_{year}/{folder_obl}"):
            for folder_crop in os.listdir(f"{path_all_folders}/ТСГ-6_{year}/{folder_obl}/{folder_st}"):
                for file in os.listdir(f"{path_all_folders}/ТСГ-6_{year}/{folder_obl}/{folder_st}/{folder_crop}"):
                    file_path = f'{path_all_folders}/ТСГ-6_{year}/{folder_obl}/{folder_st}/{folder_crop}/{file}'
                    df_class = SoilDataReder(file_path)
                    df = df_class.special_data_frame
                    df.loc[0, 'file_path'] = f'ТСГ-6_{year}/{folder_obl}/{folder_st}/{folder_crop}/{file}'
                    df.loc[0, 'Рік'] = year
                    df.loc[0, 'Область'] = folder_obl
                    df.loc[0, 'Метеостанція' ] = folder_st
                    df.loc[0, 'Культура'] = folder_crop
                    df_DB = pd.concat([df_DB, df], ignore_index=True)
#df_DB.to_excel('test.xlsx')
df_DB.to_excel('DB_Soil_water_2016_2021_raw.xlsx')

